app/controllers/backend/accounts_controller.rb

  def edit
    @account = Account.find(params[:id])
---
SELECT * FROM "accounts" WHERE ("accounts"."id" = 1) LIMIT 1